{"posts":[{"title":"About Me","text":"赵子朋，华东师范大学，软件工程研究生，研究方向为图形学物理仿真。主要针对SPH和MPM框架，以及高性能GPU并行方案。本科就读于华东师范大学物理学系。来自徽州，爱画画，爱书法，爱艺术。I am a graduate student in East China Normal University. My primary research interest is Physics-based Simulation. EDUCATION M.S. in Computer Graphics, East China Normal University. 2018- B.S. in Physics, East China Normal University. 2014-2018 RESEARCH NEWS!!! A Unified MPM Framework supporting Phase-field Models and Elastic-viscoplastic Phase TransitionZaili Tu, Chen Li, Zipeng Zhao, Long Liu, Chenhui Wang, Changbo Wang, Hong Qin.Transactions on Graphics (TOG) 2023[Paper link] A Noval Plastic Phase-field Method for Ductile Fracture with GPU OptimizationZipeng Zhao, Kemeng Huang, Chen Li, Changbo Wang, Hong Qin.Pacific Graphics 2020[Paper link] An End-to-End Model for Chinese Calligraphy GenerationPeichi Zhou, Zipeng Zhao, Kang Zhang, Chen Li, Changbo Wang.Multimedia Tools and Applications 2020[Paper link] Novel hierarchical strategies for SPH-centric algorithms on GPGPUKemeng Huang, Zipeng Zhao, Chen Li, Changbo Wang, Hong Qin.Graphical Models, Sept, 2020[Paper link] A General Novel Parallel Framework for SPH-centric Algorithms.Kemeng Huang, Jiming Ruan, Zipeng Zhao, Chen Li, Changbo Wang, Hong Qin.ACM SIGGRAPH Symposium on Interactive 3D Graphics and Games 2019 (I3D)[Paper link] Data‐driven retrieval of spray details with random forest‐based distance.Chen Peng, Zipeng Zhao, Chen Li, Changbo Wang, Hong Qin, Hongyan Quan.Computer Animation and Virtual Worlds, 2019.[Paper link] INTERESTS Painting CONTACT MEzzpzhao@outlook.com unsplash-logo安徽 泾县","link":"/2019/11/02/AboutME/"},{"title":"Painting","text":"画画素描还是很有意思的，不过个人水平有限，只能去学别人的，哈哈哈。提示：点开大图查看 :-)","link":"/2020/07/01/interests/"},{"title":"Material Point Method","text":"TODO","link":"/2020/06/23/MPM/"}],"tags":[{"name":"SPH","slug":"SPH","link":"/tags/SPH/"},{"name":"Me","slug":"Me","link":"/tags/Me/"},{"name":"MPM","slug":"MPM","link":"/tags/MPM/"}],"categories":[{"name":"Me","slug":"Me","link":"/categories/Me/"},{"name":"Research","slug":"Research","link":"/categories/Research/"}],"pages":[]}